code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаОценкиСтоимостиЦБИзНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаОценкиСтоимостиЦБИзНРД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьЗаМесяц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОценкаСтоимостиЦБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодНРД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЦБ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОценки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РыночнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаОценкиСтоимостиЦБИзНРД/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДатаЗагрузкиПриИзменении(Элемент)
	Элементы.ЗагрузитьЗаМесяц.Подсказка = "Загрузить все котировки за " + Формат(Объект.ДатаЗагрузки, "ДФ='ММММ гггг'");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаЗагрузки = ТекущаяДата();
	ДатаЗагрузкиПриИзменении(Элементы.ДатаЗагрузки);
	// По-умолчанию грузим за месяц
	Объект.ЗагрузитьЗаМесяц = Истина;
	
	Объект.ВариантЗагрузки = 0;
	
	ПолучитьКаталогЗагрузкиНаСервере();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПолучитьКаталогЗагрузкиНаСервере()
	ПутьКФайлу = "";
	
	ПараметрыИсточника	= ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловОценкиНРД);
	Если ПараметрыИсточника.Папка <> "" Тогда 
		
		Объект.ПутьКФайлуЗагрузки = СокрЛП(ПараметрыИсточника.Папка);
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	Обработка	= РеквизитФормыВЗначение("Объект");
	Обработка.ВыполнениеЗагрузкиПоСтандартнойСхеме();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
КонецПроцедуры
